app/Validation/PenggunaRules.php

  public function validateUser(string $str, string $fields, array $data){
    $model = new PenggunaModel();
    $user = $model->where('email', $data['email'])
                  ->first();
---
SELECT *
FROM `pengguna`
WHERE `email` = 'ajinazilah1995@gmail.com'
 LIMIT 1