app/Controllers/AgendaGuru.php

  public function index()
  {
  $data = session()->get();

  $agendamodel = new AgendaGuruModel();
  $agenda = $agendamodel->where('kode_guru', $data['kode_pengguna'])->findAll();

 //OK
  // $data['agenda']=$agenda;
  $data['waktu']=$this->waktu();

  //paginasi
  $data ['agenda']=  $agendamodel->where('kode_guru', $data['kode_pengguna'])->orderBy('dibuat','DESC')->paginate(10);
---
SELECT *
FROM `agenda_guru`
WHERE `kode_guru` = '52'
SELECT *
FROM `agenda_guru`
WHERE `kode_guru` = '52'
ORDER BY `dibuat` DESC
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `agenda_guru`
WHERE `kode_guru` = '52'

  public function hapuspresensi($absensi,$nis,$id_agendaguru)
  {
    $data = session()->get();

    $agenda= new AgendaGuruModel();
    $data['agenda'] = $agenda->where(['id_agendaguru'=>$id_agendaguru])->first();
---
SELECT *
FROM `agenda_guru`
WHERE `id_agendaguru` = '191'
 LIMIT 1