app/Controllers/Agenda.php

  public function index()
  {

  $agendamodel = new AgendaModel();
  $kode_agenda="";
  $agenda = $agendamodel->where('kode_agenda', $kode_agenda)->findAll();
---
SELECT *
FROM `agenda`
WHERE `kode_agenda` = ''