app/Controllers/Cetak.php

SELECT *
FROM `staf`
WHERE `kode_staf` = '52'
 LIMIT 1
---
	public function agenda()
	{
		$data = session()->get();
		if ($this->request->is('post')) {
			$stafmodel = new StafModel;
			$bulan = $this->request->getVar('bulan');
			$tahun = $this->request->getVar('tahun');
			$data['staf'] = $stafmodel->where('kode_staf', $data['kode_pengguna'])->first();