app/Controllers/Login.php

    public function Index() {
        $data = [];
        //baru
        if ( $this->request->is( 'post' ) ) {

            $rules = [
                'email' => 'required|min_length[6]|max_length[50]|valid_email',
                'password' => 'required|min_length[3]|max_length[255]|validateUser[email,password]',
            ];

            $errors = [
                'email' => [
                    'required' =>'Email belum diisi',
                    'min_length' => 'Email kurang dari 6 karakter',
                    'max_length' => 'Email lebih dari 50 karakter',
                    'valid_email' => 'format email tidak sesuai'
                ],
                'password' => [
                    'validateUser' => 'Email atau Password salah'
                ]
            ];

            if ( ! $this->validate( $rules, $errors ) ) {
                $data[ 'validation' ] = $this->validator;
                echo view( 'login' );

            } else {
                $model = new PenggunaModel();
                //$model->join('piket','piket.kode_petugas = pengguna.kode_pengguna','inner');
                $user = $model->where( 'email', $this->request->getVar( 'email' ) )->first();
---
SELECT *
FROM `pengguna`
WHERE `email` = 'ajinazilah1995@gmail.com'
 LIMIT 1

                $token = get_cookie( 'skendava' );
                $model = new PenggunaModel();

                $user = $model->where( 'token', $token )->first();
---
SELECT *
FROM `pengguna`
WHERE `token` IS NULL
 LIMIT 1