app/Controllers/Siswa.php

   public function form_terlambat($rombel=false)
  {
    $data = session()->get();
    $siswa = new SiswaModel();
    if(!$rombel)
    {
    $siswa->distinct()->select('rombel')->orderBy('rombel','ASC');
    //$siswa->distinct();
    //$data['rombel'] = $siswa->findAll();
    $data['rombel'] = $siswa->get()->getResultArray();

    //$data['tess']=$presensi->getLastQuery();
    d($data);


    return view('header')
         .view('menu',$data)
         .view('form_terlambat')
         .view('footer');
    }
    else {
      $data['nama_siswa']=$siswa->where(['rombel'=>$rombel])->first();
    //$siswa->distinct();
    //$data['rombel'] = $siswa->findAll();
    $data['rombel'] = $siswa->get()->getResultArray();
---
SELECT DISTINCT `rombel`
FROM `siswa`
ORDER BY `rombel` ASC
SELECT *
FROM `siswa`
WHERE `rombel` = 'X APL1'

  public function tampil_siswa($rombel)
  {
    //if ($this->request->isAJAX()) {
    $data = session()->get();
    $siswa = new SiswaModel();
    $data['nama_siswa']=$siswa->where(['rombel'=>$rombel])->findAll();
    //$siswa->distinct();
    //$data['rombel'] = $siswa->findAll();
    $data['rombel'] = $siswa->get()->getResultArray();
---
SELECT *
FROM `siswa`
WHERE `rombel` = 'X APL1'
 LIMIT 1
SELECT *
FROM `siswa`