app/Controllers/TugasTambahan.php

    public function index()
    {
        $data = session()->get();

        $agendatuta = new AgendaTutaModel();
        $agenda = $agendatuta->where('kode_staf', $data['kode_pengguna'])->findAll();

        //OK
        // $data[ 'agenda' ] = $agenda;
        //$data[ 'waktu' ] = $this->waktu();

        //paginasi
        $data['agenda'] = $agendatuta->where('kode_staf', $data['kode_pengguna'])->orderBy('tanggal', 'DESC')->paginate(10);
---
SELECT *
FROM `agenda_tuta`
WHERE `kode_staf` = '99'
SELECT *
FROM `agenda_tuta`
WHERE `kode_staf` = '99'
ORDER BY `tanggal` DESC
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `agenda_tuta`
WHERE `kode_staf` = '99'